----------------------------------------------------------------------------
dofile( ".\\LuaFunc\\TaxFunc.lua" )
----------------------------------------------------------------------------

MinTaxRate = 5				-- 최소 세율
MaxTaxRate = 20				-- 최대 세율

TaxSecretRoomRate	= 45	-- 대륙 점령 길드 수익률(%)
TaxLordRate			= 45	-- 군주 수익률(%)

AdmissionSecretRoomRate	= 45	-- 입장료 수익률(%)
AdmissionLordRate		= 45	-- 군주 입장료 수익률(%)

PayTime			= "00:00"		-- 세금 지급 시간
ChangeTaxTime	= "Mon 00:00"	-- 세율 변경 시간

DBSaveCount		= 10			-- DB 저장 빈도(건수)

----------------------------------------------------------------------------
-- 점령길드 전용 구매 아이템 설정 ------------------------------------------
----------------------------------------------------------------------------
AddOccupationShopItem( "II_CHP_RED" )